InformationRegisters/СертификатыПодписантовМобильнойПодписиБЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыПодписантовМобильнойПодписиБЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписантыСервисаМобильнойПодписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СертификатыПодписантовМобильнойПодписиБЭД/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр
// Параметры:
//  Подписант - СправочникСсылка.ПодписантыСервисаМобильнойПодписи - Подписант
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат
//
Процедура ДобавитьЗапись(Подписант, Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СертификатыПодписантовМобильнойПодписиБЭД");
		ЭлементБлокировкиДанных.УстановитьЗначение("Подписант", Подписант);
		ЭлементБлокировкиДанных.УстановитьЗначение("Сертификат", Сертификат);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Подписант = Подписант;
		Запись.Сертификат = Сертификат;
		Запись.Записать(Истина);

		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Добавление сертификата подписанта';
														|en = 'Add the signer certificate'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация),
			СтрШаблон(НСтр("ru = 'Не удалось записать сертификат подписанта: %1';
							|en = 'Cannot save the signer certificate: %1'"), Подписант));
			
	КонецПопытки;
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
